Revit 2027 API
Selection.SetReferences Method
 Selects the references. The references can be an element or a subelement in the host or a linked document.
Namespace: Autodesk.Revit.UI.Selection
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetReferences(
	IList<Reference> references
)
Public Sub SetReferences (
	references As IList(Of Reference)
)
public:
void SetReferences(
	IList<Reference^>^ references
)
member SetReferences :
        references : IList<Reference> -> unit
Parameters
references IList<Reference>
 The references to be selected.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Changing the selection is not permitted while handling SelectionChanged Event.
Remarks
 This function will select the specified references and update the UI.
See Also
Reference
Selection Class
Autodesk.Revit.UI.Selection Namespace